---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportAttrShowExtensionLine
source: html/38f3840f-d466-0aad-21d5-526a5ad826cf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportAttrShowExtensionLine Property

"Show Extension Line"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportAttrShowExtensionLine { get; }
```